Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ1025DAS176.PIC
      <edc:SFRDef edc:_addr="0x1F810200" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC12" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC12" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCDC3IS" edc:desc="" edc:mask="0x3" edc:name="ADCDC3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCDC3IP" edc:desc="" edc:mask="0x7" edc:name="ADCDC3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCDC4IS" edc:desc="" edc:mask="0x3" edc:name="ADCDC4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCDC4IP" edc:desc="" edc:mask="0x7" edc:name="ADCDC4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCDC5IS" edc:desc="" edc:mask="0x3" edc:name="ADCDC5IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCDC5IP" edc:desc="" edc:mask="0x7" edc:name="ADCDC5IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCDC6IS" edc:desc="" edc:mask="0x3" edc:name="ADCDC6IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCDC6IP" edc:desc="" edc:mask="0x7" edc:name="ADCDC6IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810210" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC13" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC13" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCDF1IS" edc:desc="" edc:mask="0x3" edc:name="ADCDF1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCDF1IP" edc:desc="" edc:mask="0x7" edc:name="ADCDF1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCDF2IS" edc:desc="" edc:mask="0x3" edc:name="ADCDF2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCDF2IP" edc:desc="" edc:mask="0x7" edc:name="ADCDF2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCDF3IS" edc:desc="" edc:mask="0x3" edc:name="ADCDF3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCDF3IP" edc:desc="" edc:mask="0x7" edc:name="ADCDF3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCDF4IS" edc:desc="" edc:mask="0x3" edc:name="ADCDF4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCDF4IP" edc:desc="" edc:mask="0x7" edc:name="ADCDF4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810220" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC14" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---uuuuu---00000---00000" edc:name="IPC14" edc:nzwidth="32" edc:por="---00000---xxxxx---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCDF5IS" edc:desc="" edc:mask="0x3" edc:name="ADCDF5IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCDF5IP" edc:desc="" edc:mask="0x7" edc:name="ADCDF5IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCDF6IS" edc:desc="" edc:mask="0x3" edc:name="ADCDF6IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCDF6IP" edc:desc="" edc:mask="0x7" edc:name="ADCDF6IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCFLTIS" edc:mask="0x3" edc:name="ADCFLTIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCFLTIP" edc:mask="0x7" edc:name="ADCFLTIP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD0IS" edc:desc="" edc:mask="0x3" edc:name="ADCD0IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD0IP" edc:desc="" edc:mask="0x7" edc:name="ADCD0IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810230" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC15" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC15" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD1IS" edc:desc="" edc:mask="0x3" edc:name="ADCD1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD1IP" edc:desc="" edc:mask="0x7" edc:name="ADCD1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD2IS" edc:desc="" edc:mask="0x3" edc:name="ADCD2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD2IP" edc:desc="" edc:mask="0x7" edc:name="ADCD2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD3IS" edc:desc="" edc:mask="0x3" edc:name="ADCD3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD3IP" edc:desc="" edc:mask="0x7" edc:name="ADCD3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD4IS" edc:desc="" edc:mask="0x3" edc:name="ADCD4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD4IP" edc:desc="" edc:mask="0x7" edc:name="ADCD4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810240" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC16" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC16" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD5IS" edc:desc="" edc:mask="0x3" edc:name="ADCD5IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD5IP" edc:desc="" edc:mask="0x7" edc:name="ADCD5IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD6IS" edc:desc="" edc:mask="0x3" edc:name="ADCD6IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD6IP" edc:desc="" edc:mask="0x7" edc:name="ADCD6IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD7IS" edc:desc="" edc:mask="0x3" edc:name="ADCD7IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD7IP" edc:desc="" edc:mask="0x7" edc:name="ADCD7IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ADCD8IS" edc:desc="" edc:mask="0x3" edc:name="ADCD8IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ADCD8IP" edc:desc="" edc:mask="0x7" edc:name="ADCD8IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
