Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ1025DAS176.PIC
      <edc:SFRDef edc:_addr="0x1F8E307C" edc:_begin="0x78" edc:_end="0xc0" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBEOFRST" edc:desc="" edc:impl="0x3ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000011100100111011110000000" edc:name="USBEOFRST" edc:nzwidth="32" edc:por="00000000011100100111011110000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="HSEOF" edc:desc="" edc:mask="0xff" edc:name="HSEOF" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="FSEOF" edc:desc="" edc:mask="0xff" edc:name="FSEOF" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="LSEOF" edc:desc="" edc:mask="0xff" edc:name="LSEOF" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="NRST" edc:desc="Reset of CLK Domain bit" edc:mask="0x1" edc:name="NRST" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NRSTX" edc:desc="Reset of XCLK Domain bit" edc:mask="0x1" edc:name="NRSTX" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="SOFRST" edc:desc="Soft Reset" edc:mask="0xff" edc:name="SOFRST" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3080" edc:_begin="0x78" edc:_end="0xc0" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="4" edc:access="-nnnnnnnnnnnnnnn---------nnnnnnn" edc:cname="USBE0TXA" edc:desc="" edc:impl="0x7fff007f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000000000000000---------0000000" edc:name="USBE0TXA" edc:nzwidth="32" edc:por="-000000000000000---------0000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXFADDR" edc:desc="" edc:mask="0x7f" edc:name="TXFADDR" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="9"/>
            <edc:SFRFieldDef edc:cname="TXHUBADD" edc:desc="" edc:mask="0x7f" edc:name="TXHUBADD" edc:nzwidth="7"/>
            <edc:SFRFieldDef edc:cname="MULTTRAN" edc:desc="" edc:mask="0x1" edc:name="MULTTRAN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TXHUBPRT" edc:desc="" edc:mask="0x7f" edc:name="TXHUBPRT" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3084" edc:_begin="0x78" edc:_end="0xc0" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="4" edc:access="-nnnnnnnnnnnnnnn----------------" edc:cname="USBE0RXA" edc:desc="" edc:impl="0x7fff0000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000000000000000----------------" edc:name="USBE0RXA" edc:nzwidth="32" edc:por="-000000000000000----------------" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="16"/>
            <edc:SFRFieldDef edc:cname="RXHUBADD" edc:desc="" edc:mask="0x7f" edc:name="RXHUBADD" edc:nzwidth="7"/>
            <edc:SFRFieldDef edc:cname="MULTTRAN" edc:desc="" edc:mask="0x1" edc:name="MULTTRAN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RXHUBPRT" edc:desc="" edc:mask="0x7f" edc:name="RXHUBPRT" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3088" edc:_begin="0x78" edc:_end="0xc0" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="4" edc:access="-nnnnnnnnnnnnnnn---------nnnnnnn" edc:cname="USBE1TXA" edc:desc="" edc:impl="0x7fff007f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000000000000000---------0000000" edc:name="USBE1TXA" edc:nzwidth="32" edc:por="-000000000000000---------0000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXFADDR" edc:desc="" edc:mask="0x7f" edc:name="TXFADDR" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="9"/>
            <edc:SFRFieldDef edc:cname="TXHUBADD" edc:desc="" edc:mask="0x7f" edc:name="TXHUBADD" edc:nzwidth="7"/>
            <edc:SFRFieldDef edc:cname="MULTTRAN" edc:desc="" edc:mask="0x1" edc:name="MULTTRAN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TXHUBPRT" edc:desc="" edc:mask="0x7f" edc:name="TXHUBPRT" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E308C" edc:_begin="0x78" edc:_end="0xc0" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="4" edc:access="-nnnnnnnnnnnnnnn---------nnnnnnn" edc:cname="USBE1RXA" edc:desc="" edc:impl="0x7fff007f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000000000000000---------0000000" edc:name="USBE1RXA" edc:nzwidth="32" edc:por="-000000000000000---------0000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXFADDR" edc:desc="" edc:mask="0x7f" edc:name="RXFADDR" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="9"/>
            <edc:SFRFieldDef edc:cname="RXHUBADD" edc:desc="" edc:mask="0x7f" edc:name="RXHUBADD" edc:nzwidth="7"/>
            <edc:SFRFieldDef edc:cname="MULTTRAN" edc:desc="" edc:mask="0x1" edc:name="MULTTRAN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RXHUBPRT" edc:desc="" edc:mask="0x7f" edc:name="RXHUBPRT" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3090" edc:_begin="0x78" edc:_end="0xc0" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="4" edc:access="-nnnnnnnnnnnnnnn---------nnnnnnn" edc:cname="USBE2TXA" edc:desc="" edc:impl="0x7fff007f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000000000000000---------0000000" edc:name="USBE2TXA" edc:nzwidth="32" edc:por="-000000000000000---------0000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXFADDR" edc:desc="" edc:mask="0x7f" edc:name="TXFADDR" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="9"/>
            <edc:SFRFieldDef edc:cname="TXHUBADD" edc:desc="" edc:mask="0x7f" edc:name="TXHUBADD" edc:nzwidth="7"/>
            <edc:SFRFieldDef edc:cname="MULTTRAN" edc:desc="" edc:mask="0x1" edc:name="MULTTRAN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TXHUBPRT" edc:desc="" edc:mask="0x7f" edc:name="TXHUBPRT" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3094" edc:_begin="0x78" edc:_end="0xc0" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="4" edc:access="-nnnnnnnnnnnnnnn---------nnnnnnn" edc:cname="USBE2RXA" edc:desc="" edc:impl="0x7fff007f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000000000000000---------0000000" edc:name="USBE2RXA" edc:nzwidth="32" edc:por="-000000000000000---------0000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXFADDR" edc:desc="" edc:mask="0x7f" edc:name="RXFADDR" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="9"/>
            <edc:SFRFieldDef edc:cname="RXHUBADD" edc:desc="" edc:mask="0x7f" edc:name="RXHUBADD" edc:nzwidth="7"/>
            <edc:SFRFieldDef edc:cname="MULTTRAN" edc:desc="" edc:mask="0x1" edc:name="MULTTRAN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RXHUBPRT" edc:desc="" edc:mask="0x7f" edc:name="RXHUBPRT" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3098" edc:_begin="0x78" edc:_end="0xc0" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="4" edc:access="-nnnnnnnnnnnnnnn---------nnnnnnn" edc:cname="USBE3TXA" edc:desc="" edc:impl="0x7fff007f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000000000000000---------0000000" edc:name="USBE3TXA" edc:nzwidth="32" edc:por="-000000000000000---------0000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXFADDR" edc:desc="" edc:mask="0x7f" edc:name="TXFADDR" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="9"/>
            <edc:SFRFieldDef edc:cname="TXHUBADD" edc:desc="" edc:mask="0x7f" edc:name="TXHUBADD" edc:nzwidth="7"/>
            <edc:SFRFieldDef edc:cname="MULTTRAN" edc:desc="" edc:mask="0x1" edc:name="MULTTRAN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TXHUBPRT" edc:desc="" edc:mask="0x7f" edc:name="TXHUBPRT" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E309C" edc:_begin="0x78" edc:_end="0xc0" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="4" edc:access="-nnnnnnnnnnnnnnn---------nnnnnnn" edc:cname="USBE3RXA" edc:desc="" edc:impl="0x7fff007f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000000000000000---------0000000" edc:name="USBE3RXA" edc:nzwidth="32" edc:por="-000000000000000---------0000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXFADDR" edc:desc="" edc:mask="0x7f" edc:name="RXFADDR" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="9"/>
            <edc:SFRFieldDef edc:cname="RXHUBADD" edc:desc="" edc:mask="0x7f" edc:name="RXHUBADD" edc:nzwidth="7"/>
            <edc:SFRFieldDef edc:cname="MULTTRAN" edc:desc="" edc:mask="0x1" edc:name="MULTTRAN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RXHUBPRT" edc:desc="" edc:mask="0x7f" edc:name="RXHUBPRT" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E30A0" edc:_begin="0x78" edc:_end="0xc0" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="4" edc:access="-nnnnnnnnnnnnnnn---------nnnnnnn" edc:cname="USBE4TXA" edc:desc="" edc:impl="0x7fff007f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000000000000000---------0000000" edc:name="USBE4TXA" edc:nzwidth="32" edc:por="-000000000000000---------0000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXFADDR" edc:desc="" edc:mask="0x7f" edc:name="TXFADDR" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="9"/>
            <edc:SFRFieldDef edc:cname="TXHUBADD" edc:desc="" edc:mask="0x7f" edc:name="TXHUBADD" edc:nzwidth="7"/>
            <edc:SFRFieldDef edc:cname="MULTTRAN" edc:desc="" edc:mask="0x1" edc:name="MULTTRAN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TXHUBPRT" edc:desc="" edc:mask="0x7f" edc:name="TXHUBPRT" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E30A4" edc:_begin="0x78" edc:_end="0xc0" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="4" edc:access="-nnnnnnnnnnnnnnn---------nnnnnnn" edc:cname="USBE4RXA" edc:desc="" edc:impl="0x7fff007f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000000000000000---------0000000" edc:name="USBE4RXA" edc:nzwidth="32" edc:por="-000000000000000---------0000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXFADDR" edc:desc="" edc:mask="0x7f" edc:name="RXFADDR" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="9"/>
            <edc:SFRFieldDef edc:cname="RXHUBADD" edc:desc="" edc:mask="0x7f" edc:name="RXHUBADD" edc:nzwidth="7"/>
            <edc:SFRFieldDef edc:cname="MULTTRAN" edc:desc="" edc:mask="0x1" edc:name="MULTTRAN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RXHUBPRT" edc:desc="" edc:mask="0x7f" edc:name="RXHUBPRT" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E30A8" edc:_begin="0x78" edc:_end="0xc0" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="4" edc:access="-nnnnnnnnnnnnnnn---------nnnnnnn" edc:cname="USBE5TXA" edc:desc="" edc:impl="0x7fff007f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000000000000000---------0000000" edc:name="USBE5TXA" edc:nzwidth="32" edc:por="-000000000000000---------0000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXFADDR" edc:desc="" edc:mask="0x7f" edc:name="TXFADDR" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="9"/>
            <edc:SFRFieldDef edc:cname="TXHUBADD" edc:desc="" edc:mask="0x7f" edc:name="TXHUBADD" edc:nzwidth="7"/>
            <edc:SFRFieldDef edc:cname="MULTTRAN" edc:desc="" edc:mask="0x1" edc:name="MULTTRAN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TXHUBPRT" edc:desc="" edc:mask="0x7f" edc:name="TXHUBPRT" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E30AC" edc:_begin="0x78" edc:_end="0xc0" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="4" edc:access="-nnnnnnnnnnnnnnn---------nnnnnnn" edc:cname="USBE5RXA" edc:desc="" edc:impl="0x7fff007f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000000000000000---------0000000" edc:name="USBE5RXA" edc:nzwidth="32" edc:por="-000000000000000---------0000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXFADDR" edc:desc="" edc:mask="0x7f" edc:name="RXFADDR" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="9"/>
            <edc:SFRFieldDef edc:cname="RXHUBADD" edc:desc="" edc:mask="0x7f" edc:name="RXHUBADD" edc:nzwidth="7"/>
            <edc:SFRFieldDef edc:cname="MULTTRAN" edc:desc="" edc:mask="0x1" edc:name="MULTTRAN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RXHUBPRT" edc:desc="" edc:mask="0x7f" edc:name="RXHUBPRT" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E30B0" edc:_begin="0x78" edc:_end="0xc0" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="4" edc:access="-nnnnnnnnnnnnnnn---------nnnnnnn" edc:cname="USBE6TXA" edc:desc="" edc:impl="0x7fff007f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000000000000000---------0000000" edc:name="USBE6TXA" edc:nzwidth="32" edc:por="-000000000000000---------0000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXFADDR" edc:desc="" edc:mask="0x7f" edc:name="TXFADDR" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="9"/>
            <edc:SFRFieldDef edc:cname="TXHUBADD" edc:desc="" edc:mask="0x7f" edc:name="TXHUBADD" edc:nzwidth="7"/>
            <edc:SFRFieldDef edc:cname="MULTTRAN" edc:desc="" edc:mask="0x1" edc:name="MULTTRAN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TXHUBPRT" edc:desc="" edc:mask="0x7f" edc:name="TXHUBPRT" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
